In [1]:
import pandas as pd

In [3]:
L = ['a', 'b', 'c', 'd', 'e', 'f', 'g']

names = ['Patience','Leslie','Sam','John','Charles','Beryl','Jesse']

In [10]:
play = pd.Series(names, index=L)

In [11]:
play

a    Patience
b      Leslie
c         Sam
d        John
e     Charles
f       Beryl
g       Jesse
dtype: object

In [12]:
play.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [16]:
names[1]

'b'

In [18]:
play['b']

'Leslie'

In [19]:
play.loc[:'e']

a    Patience
b      Leslie
c         Sam
d        John
e     Charles
dtype: object

In [20]:
play.loc['e':]

e    Charles
f      Beryl
g      Jesse
dtype: object

In [21]:
play.loc[::2]

a    Patience
c         Sam
e     Charles
g       Jesse
dtype: object

In [24]:
play.iloc[::2]

a    Patience
c         Sam
e     Charles
g       Jesse
dtype: object

In [30]:
play.iloc[0:5:2] ## And you realise we're only having numbers. 
# Changing iloc to loc will cause an error
# unless for loc the numbers are changed to label

a    Patience
c         Sam
e     Charles
dtype: object

In [31]:
play.loc['a':'e':2]

a    Patience
c         Sam
e     Charles
dtype: object

In [32]:
sex = ['F','M',  'M', 'F']
age =[ 21, 23, 45, 67]

In [35]:
df = pd.DataFrame({'Gender':sex, 'Age':age})
df

  Gender  Age
0      F   21
1      M   23
2      M   45
3      F   67

In [36]:
data=[['M',23],['F',31],['M',25],['F',12]]

In [39]:
df = pd.DataFrame(data,columns=['Gender','Age'])
df

  Gender  Age
0      M   23
1      F   31
2      M   25
3      F   12

In [40]:
data

[['M', 23], ['F', 31], ['M', 25], ['F', 12]]

In [42]:
df.iloc[:2]

  Gender  Age
0      M   23
1      F   31

In [44]:
df.iloc[:2,:]

  Gender  Age
0      M   23
1      F   31

In [54]:
df.iloc[:2,1]

0    23
1    31
Name: Age, dtype: int64

In [55]:
df.iloc[:2,0]

0    M
1    F
Name: Gender, dtype: object

In [56]:
df.iloc[:2]

  Gender  Age
0      M   23
1      F   31

In [60]:
df['Age']

0    23
1    31
2    25
3    12
Name: Age, dtype: int64

In [72]:
df['Names']=['Patience','  ','Sam','John']
df

  Gender  Age     Names HairStyle  Grades
0      M   23  Patience     Kinky   23.00
1      F   31              Fading   43.00
2      M   25       Sam      Punk   32.13
3      F   12      John    Twists   54.23

In [73]:
df['HairStyle']=['Kinky','Fading', 'Punk','Twists']
df

  Gender  Age     Names HairStyle  Grades
0      M   23  Patience     Kinky   23.00
1      F   31              Fading   43.00
2      M   25       Sam      Punk   32.13
3      F   12      John    Twists   54.23

In [74]:
df['Grades']=[23.00,43.00,32.13,54.23]
df

  Gender  Age     Names HairStyle  Grades
0      M   23  Patience     Kinky   23.00
1      F   31              Fading   43.00
2      M   25       Sam      Punk   32.13
3      F   12      John    Twists   54.23

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Gender     4 non-null      object
 1   Age        4 non-null      int64
 2   Names      4 non-null      object
 3   HairStyle  4 non-null      object
 4   Grades     4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 292.0+ bytes

In [76]:
df.describe()

             Age     Grades
count   4.000000   4.000000
mean   22.750000  38.090000
std     7.932003  13.513418
min    12.000000  23.000000
25%    20.250000  29.847500
50%    24.000000  37.565000
75%    26.500000  45.807500
max    31.000000  54.230000

In [ ]:
df.drop['']